 * DataFrame
 * Missing Data
 * GroupBy
 * Merging Joining and Concatinating
 * operations

In [1]:
import pandas as pd
import numpy as np
from numpy.random import randn
np.random.seed(223)

In [2]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(), columns='W X Y Z'.split())

In [3]:
df

          W         X         Y         Z
A  0.534775  0.584880  0.355374  0.648426
B  0.379148  0.212069 -1.274577 -0.503278
C  0.325044 -0.812596  0.391115  0.303785
D  0.369766 -0.317865  1.950174  0.736912
E -1.800955  0.644342 -0.177704  0.085804

In [4]:
df_1 = df.drop('A', axis=0)

In [5]:
df_1

          W         X         Y         Z
B  0.379148  0.212069 -1.274577 -0.503278
C  0.325044 -0.812596  0.391115  0.303785
D  0.369766 -0.317865  1.950174  0.736912
E -1.800955  0.644342 -0.177704  0.085804

In [6]:
df

          W         X         Y         Z
A  0.534775  0.584880  0.355374  0.648426
B  0.379148  0.212069 -1.274577 -0.503278
C  0.325044 -0.812596  0.391115  0.303785
D  0.369766 -0.317865  1.950174  0.736912
E -1.800955  0.644342 -0.177704  0.085804

In [7]:
df.loc['C']['X']

-0.8125963923040018

In [8]:
df.loc[['B','D']]

          W         X         Y         Z
B  0.379148  0.212069 -1.274577 -0.503278
D  0.369766 -0.317865  1.950174  0.736912

In [9]:
df.loc['B', 'Y']

-1.2745773366774797

In [10]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  0.534775  0.355374
B  0.379148 -1.274577

# CONDITIONAL SELECTION

In [11]:
df>0

       W      X      Y      Z
A   True   True   True   True
B   True   True  False  False
C   True  False   True   True
D   True  False   True   True
E  False   True  False   True

In [12]:
df[df>0]

          W         X         Y         Z
A  0.534775  0.584880  0.355374  0.648426
B  0.379148  0.212069       NaN       NaN
C  0.325044       NaN  0.391115  0.303785
D  0.369766       NaN  1.950174  0.736912
E       NaN  0.644342       NaN  0.085804

In [13]:
df[df['W']>0]

          W         X         Y         Z
A  0.534775  0.584880  0.355374  0.648426
B  0.379148  0.212069 -1.274577 -0.503278
C  0.325044 -0.812596  0.391115  0.303785
D  0.369766 -0.317865  1.950174  0.736912

In [14]:
df[df['W']>0]['Y']

A    0.355374
B   -1.274577
C    0.391115
D    1.950174
Name: Y, dtype: float64

In [15]:
df[df['W']>0][['Y','Z']]

          Y         Z
A  0.355374  0.648426
B -1.274577 -0.503278
C  0.391115  0.303785
D  1.950174  0.736912

In [16]:
df[df['W']>df['Y']]

          W         X         Y         Z
A  0.534775  0.584880  0.355374  0.648426
B  0.379148  0.212069 -1.274577 -0.503278

In [17]:
df

          W         X         Y         Z
A  0.534775  0.584880  0.355374  0.648426
B  0.379148  0.212069 -1.274577 -0.503278
C  0.325044 -0.812596  0.391115  0.303785
D  0.369766 -0.317865  1.950174  0.736912
E -1.800955  0.644342 -0.177704  0.085804

In [18]:
# the & is used for and operator inside a data frame

In [19]:
df[(df['W']>0) & (df['Y']>1)]

          W         X         Y         Z
D  0.369766 -0.317865  1.950174  0.736912

In [20]:
df[(df['W']>0) | (df['Y']> .5)]

          W         X         Y         Z
A  0.534775  0.584880  0.355374  0.648426
B  0.379148  0.212069 -1.274577 -0.503278
C  0.325044 -0.812596  0.391115  0.303785
D  0.369766 -0.317865  1.950174  0.736912

# More index Details

In [21]:
# Reset to default index 0,1,2,3,4,...
df.reset_index()

  index         W         X         Y         Z
0     A  0.534775  0.584880  0.355374  0.648426
1     B  0.379148  0.212069 -1.274577 -0.503278
2     C  0.325044 -0.812596  0.391115  0.303785
3     D  0.369766 -0.317865  1.950174  0.736912
4     E -1.800955  0.644342 -0.177704  0.085804

In [22]:
new_index = 'CA NY WY OR CO'.split()

In [23]:
df['States'] = new_index

In [24]:
#df

In [25]:
df.set_index('States')

               W         X         Y         Z
States
CA      0.534775  0.584880  0.355374  0.648426
NY      0.379148  0.212069 -1.274577 -0.503278
WY      0.325044 -0.812596  0.391115  0.303785
OR      0.369766 -0.317865  1.950174  0.736912
CO     -1.800955  0.644342 -0.177704  0.085804

# Multiple-Index and Index Hierarchy

In [26]:
# Index levels
outside = ['G1', 'G1','G1', 'G2', 'G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [27]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [28]:
multi_df = pd.DataFrame(np.random.randn(6,2), index=hier_index, columns=['A', 'B'])

In [29]:
multi_df

             A         B
G1 1 -1.421768 -1.648509
   2 -1.217484 -0.977020
   3 -0.251669 -1.414437
G2 1 -0.970375 -0.140800
   2 -1.133842  0.953798
   3 -1.467732 -1.797541

In [30]:
multi_df.loc['G1']

          A         B
1 -1.421768 -1.648509
2 -1.217484 -0.977020
3 -0.251669 -1.414437

In [31]:
multi_df.loc['G1'].loc[1]

A   -1.421768
B   -1.648509
Name: 1, dtype: float64

In [32]:
multi_df.index.names

FrozenList([None, None])

In [33]:
multi_df.index.names =['Group', 'Num']

In [34]:
multi_df.index.names

FrozenList(['Group', 'Num'])

In [35]:
multi_df

                  A         B
Group Num
G1    1   -1.421768 -1.648509
      2   -1.217484 -0.977020
      3   -0.251669 -1.414437
G2    1   -0.970375 -0.140800
      2   -1.133842  0.953798
      3   -1.467732 -1.797541

# Cross Section

In [37]:
multi_df.xs(['G1',1])

A   -1.421768
B   -1.648509
Name: (G1, 1), dtype: float64

In [38]:
multi_df.xs(1, level='Num')

              A         B
Group
G1    -1.421768 -1.648509
G2    -0.970375 -0.140800